## Databases

In [7]:
import sqlite3
#sqlite
connection = sqlite3.connect('sqlite_db.sqlite')

cursor = connection.cursor()

query = "select datetime('now', 'localtime')"

results = cursor.execute(query)

row = results.fetchall()
print(row)
time = row[0]
print(time)

cursor.close()
connection.commit()
connection.close()

[('2025-04-14 19:19:12',)]
('2025-04-14 19:19:12',)

In [8]:
with sqlite3.connect('test_database.db') as connection:
    cursor = connection.cursor()
    query = 'create table abc(id int)'
    results = cursor.execute(query)

In [ ]:
#Create a table with 2 rows in an sqlite database

In [14]:
with sqlite3.connect('mydatabase.db') as connection:
    cursor = connection.cursor()
    query1 = "create table if not exists newtable(name text)"
    query2 = "insert into newtable values('Jack'), ('John')"
    cursor.execute(query1)
    cursor.execute(query2)
    connection.commit()

In [15]:
query1 = "create table if not exists newtable(name text)"
query2 = "insert into newtable values('Jack'), ('John')"

connection = sqlite3.connect('mydatabase.db')
cursor = connection.cursor()
cursor.execute(query1)
cursor.execute(query2)
cursor.close()
connection.commit()
connection.close()

In [17]:
anylist = [
'drop table if exists newtable;',
'create table newtable (firstname text, lastname text, age int);',
"insert into newtable values ('Fran', 'Marquez', 25), ('Bradley', 'Barcola', 27)"
]
with sqlite3.connect('mydatabase.db') as connection:
    cursor = connection.cursor()
    for i in anylist:
        cursor.execute(i)

In [20]:
import pyodbc
connection = pyodbc.connect('Driver={SQL Server Native Client 11.0};'
                            'Server=DESKTOP-EL5LQKN;'
                            'Database=W3Resource;'
                            'Trusted_Connection=yes;')
cursor=connection.cursor()
sql = 'select * from Colleagues'
result = cursor.execute(sql)
print(result.fetchall())
cursor.close()
connection.commit()
connection.close()

[('A', 'John', 'Engineer'), ('A', 'Jack', 'Officer'), ('B', 'John', 'Manager'), ('B', 'Jack', 'Manager'), ('D', 'John', 'Chairman'), ('E', 'Jack', 'Department Head')]

In [23]:
import sqlalchemy as sa
import pandas as pd

connection_string = 'mssql+pyodbc://DESKTOP-EL5LQKN/W3Resource?driver=SQL+Server'
engine = sa.create_engine(connection_string)
con = engine.connect()

df = pd.read_sql(sa.text('select * from Colleagues'), con=con)
df

  Workplace  Name            Roles
0         A  John         Engineer
1         A  Jack          Officer
2         B  John          Manager
3         B  Jack          Manager
4         D  John         Chairman
5         E  Jack  Department Head

In [34]:
#From your sql server, take any table, and import it to sqlite database, and to one csv file
#hint: you can use pandas for both of these options

connection = pyodbc.connect('Driver={SQL Server Native Client 11.0};'
                            'Server=DESKTOP-EL5LQKN;'
                            'Database=W3Resource;'
                            'Trusted_Connection=yes;')

query = 'select * from Colleagues'
df = pd.read_sql(query, connection)

connection_sqlite = sqlite3.connect('mydatabase.db')
df.to_csv('colleagues.csv', index=False)
df.to_sql('colleagues', connection_sqlite, if_exists='replace', index=False)

connection.close()
connection_sqlite.close()

C:\Users\User\AppData\Local\Temp\ipykernel_16452\3664038956.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, connection)

In [42]:
#Go to any of your favourite restaurant's or fast-food chain's website
#Take 5 products with their price, display them in the menu
#As the user orders some products, write the order details to the Orders table in sql
#And note that the user can order multiple products in one go
#2 points

Turka_Saray = [('Russian pancakes',45000), ('Breakfast for 1 person',115000), ('Shakshuka',65000), ('Menemen',45000), ('Scrambled eggs',45000)]

conn = sqlite3.connect('mydatabase.db')
c = conn.cursor()
c.execute('''
CREATE TABLE IF NOT EXISTS menu(id integer primary key, name text, price int)
''')
c.execute('''
CREATE TABLE IF NOT EXISTS Orders(id integer primary key, item_id integer, quantity int, foreign key(item_id) references menu(id))
''')

def create_menu():
    c.executemany('Insert into menu(name, price) values (?, ?)', Turka_Saray)
    conn.commit()

def display_menu():
    print('Menu:')
    c.execute('select * from menu')
    items = c.fetchall()
    for i in items:
        print(f'{i[0]}. {i[1]} - {i[2]} UZS')
def take_order():
    display_menu()
    item_id = int(input('Enter the item number you want to order: '))
    quantity = int(input('What is the quantity?'))

    c.execute('Insert into Orders(item_id, quantity) values (?, ?)', (item_id, quantity))
    conn.commit()
    print('Your order has been received')
def program():
    create_menu()
    while True:
        take_order()
        another_order = input('Would you like to order something else? (yes or no)').lower()
        if another_order != 'yes':
            break
    conn.close()

In [43]:
program()

Menu:
1. Russian pancakes - 45000 UZS
2. Breakfast for 1 person - 115000 UZS
3. Shakshuka - 65000 UZS
4. Menemen - 45000 UZS
5. Scrambled eggs - 45000 UZS
6. Russian pancakes - 45000 UZS
7. Breakfast for 1 person - 115000 UZS
8. Shakshuka - 65000 UZS
9. Menemen - 45000 UZS
10. Scrambled eggs - 45000 UZS

Your order has been received
Menu:
1. Russian pancakes - 45000 UZS
2. Breakfast for 1 person - 115000 UZS
3. Shakshuka - 65000 UZS
4. Menemen - 45000 UZS
5. Scrambled eggs - 45000 UZS
6. Russian pancakes - 45000 UZS
7. Breakfast for 1 person - 115000 UZS
8. Shakshuka - 65000 UZS
9. Menemen - 45000 UZS
10. Scrambled eggs - 45000 UZS
Your order has been received